---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.InstanceStructUsageParam
source: html/179b01a9-e5aa-ce0e-fb48-8d6527522a82.htm
---
# Autodesk.Revit.DB.ParameterTypeId.InstanceStructUsageParam Property

"Structural Usage"

## Syntax (C#)
```csharp
public static ForgeTypeId InstanceStructUsageParam { get; }
```